#include <iostream>
#include "CashExpense.hpp"
#include "winconio.h"
using namespace std;

/*
”слови€ конкурса :
Х ѕриложение должно позвол€ть :
Х добавл€ть / редактировать / удал€ть расходы
Х хранить врем€, сумму, описание(напр. "продукты")
Х добавл€ть / редактировать / удал€ть доходы
Х хранить врем€, сумму, описание(напр. "зарплата")
Х подводить итоги мес€ца / недели / вручную указанного периода(сумма доходов минус сумма расходов за период)
например :
	21.11.21 Ч 31.11.21 * доход 1000 расход 520 остаток : 480
	
	Х добавл€ть / редактировать / удал€ть планируемые расходы
	Х помимо информации о расходе хранить также информацию о том, был ли он осуществлен
	Х неосуществленные расходы не участвуют в итогах.
	
	Х добавл€ть / редактировать / удал€ть планируемые доходы
	Х помимо информации о доходе хранить 
		также информацию о том, был ли он получен 
	Х неполученные доходы не участвуют в итогах.
	
	Ќефункциональные требовани€ :
Х –еализовать консольное приложение
Х сохран€ть информацию введенную пользователем в файл(ы)
Х при запуске загружать информацию из файла, 
	при выходе сохран€ть информацию файл
Х к визуальному оформлению требований нет
Х ѕомимо выполнени€ самого задани€ будут также оцениватьс€ оформление кода
	(читабельность, разделение по файлам / классам,
		соответствие хорошим практикам).
*/
int main()
{
	SetConsoleWindowSize(100, 50);
	SetConsoleCursorSize();

	int value = 12500;
	string description = "";
	bool done = false;
	const DateTime& date = DateTime();


	CashExpense* a = new CashExpense(date, value, description, done);

	cout << a->getValue();
	delete a;
}