#include <iostream>
#include "Aplication.hpp"
#include "winconio.h"
using namespace std;

/*
”слови€ конкурса :
Х ѕриложение должно позвол€ть :
Х добавл€ть / редактировать / удал€ть расходы
Х хранить врем€, сумму, описание(напр. "продукты")
Х добавл€ть / редактировать / удал€ть доходы
Х хранить врем€, сумму, описание(напр. "зарплата")
Х подводить итоги мес€ца / недели / вручную указанного периода(сумма доходов минус сумма расходов за период)
например :
	21.11.21 Ч 31.11.21 * доход 1000 расход 520 остаток : 480
	
	Х добавл€ть / редактировать / удал€ть планируемые расходы
	Х помимо информации о расходе хранить также информацию о том, был ли он осуществлен
	Х неосуществленные расходы не участвуют в итогах.
	
	Х добавл€ть / редактировать / удал€ть планируемые доходы
	Х помимо информации о доходе хранить 
		также информацию о том, был ли он получен 
	Х неполученные доходы не участвуют в итогах.
	
	Ќефункциональные требовани€ :
Х –еализовать консольное приложение
Х сохран€ть информацию введенную пользователем в файл(ы)
Х при запуске загружать информацию из файла, 
	при выходе сохран€ть информацию файл
Х к визуальному оформлению требований нет
Х ѕомимо выполнени€ самого задани€ будут также оцениватьс€ оформление кода
	(читабельность, разделение по файлам / классам,
		соответствие хорошим практикам).
*/

//> < == DateTime
//sort vectors 

int main()
{
	SetConsoleWindowSize(100, 50);
	SetConsoleCursorSize();
	
	Aplication app;

	CashExpense ce[3] = { CashExpense(DateTime(2, 2, 2022), -1200),
						  CashExpense(DateTime(2, 2, 1991), -1300),
						  CashExpense(DateTime(2, 2, 2003), -2220) };

	for (int i = 0; i < 3; i++)
	{
		app.addCashExpense(ce[i]);
	}

	// test sorts 
	cout << "Not sorted array: \n\n";
	app.printCashExpenses();
	app.bubleSortExpenses();
	cout << "\nSorted array: \n\n";
	app.printCashExpenses();
	//app.addCashExpense(DateTime(), -2000, "bebra", true);
	//DateTime dt(1, 1, 2021, 20, 12);
	////DateTime dt2(1, 1, 2021, 20, 12);
	//DateTime dt2(1, 1, 1992, 20, 12);

	//cout << dt.getCountDaysFrom1990() << "\t" << dt2.getCountDaysFrom1990() << endl;
	//cout << (bool) (dt < dt2);
	//for (int i = 1; i <= 100; i++)
	//	cout << "|";
}